app/views/films/_form.html.erb

		<%= f.label :Gênero%><br>
		<% genre_array = Genre.all.map { |genre| [genre.name, genre.id] } %>
---
SELECT "genres".* FROM "genres"