app/views/films/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."film_id" = ?  [["film_id", 7]]
---
		</article>
		<%= link_to pluralize(@film.comments.size, 'Comentário', 'Comentários'), film_comments_path(@film)%>