app/controllers/comments_controller.rb

	def create
		@comment = @film.comments.new(comment_params)
		if @comment.save
---
INSERT INTO "comments" ("name", "rating", "comment", "film_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

		def set_film
			@film = Film.find(params[:film_id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]