app/controllers/films_controller.rb

	def index
		@films = Film.search(params[:search]).created_at
---
SELECT "films".* FROM "films" WHERE (name LIKE '%os%') AND (created_at <= '2018-07-19 19:17:30.517915') ORDER BY id DESC, created_at desc

	def create
		@film = Film.new(film_params)
		if @film.save
---
INSERT INTO "films" ("name", "description", "year", "price", "genre_id", "created_at", "updated_at", "poster") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def show
		@film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def edit
		@film = Film.find(params[:id])
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

	def update
		@film = Film.find(params[:id])
		@film.update(film_params)
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "films" SET "name" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["name", "O Chamado2"], ["updated_at", "2018-07-19 12:24:15.316279"], ["id", 6]]

	def destroy
		@film = Film.find(params[:id])
		@film.destroy
---
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "films" WHERE "films"."id" = ?  [["id", 6]]